package ru.practikum.yandex.pageobject;//package ru.practikum.yandex;
//
//public class LocatorsMainPage {
//
//    Кнопка Заказать вверху страницы
//    By.xpath (".//button[@class='Button_Button__ra12g']");
//
//    Кнопка Заказать внизу страницы
//    By.xpath (".//button[@class='Button_Middle__1CSJM']");
//
//    FAQ:
//
//    кнопка:Сколько это стоит? И как оплатить?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Сколько это стоит? И как оплатить?')]";
//
//    ответ:Сутки — 400 рублей. Оплата курьеру — наличными или картой.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.')]";
//
//    кнопка:Хочу сразу несколько самокатов! Так можно?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Хочу сразу несколько самокатов! Так можно?')]";
//
//    ответ:Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.')]";
//
//    кнопка:Как рассчитывается время аренды?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Как рассчитывается время аренды?')]";
//
//    ответ:Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.')]";
//
//    кнопка:Можно ли заказать самокат прямо на сегодня?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Можно ли заказать самокат прямо на сегодня?)]";
//
//    ответ:Только начиная с завтрашнего дня. Но скоро станем расторопнее.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.')]";
//
//    кнопка:Можно ли продлить заказ или вернуть самокат раньше?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Можно ли продлить заказ или вернуть самокат раньше?')]";
//
//    ответ:Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.')]";
//
//    кнопка:Вы привозите зарядку вместе с самокатом?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Вы привозите зарядку вместе с самокатом?)]";
//
//    ответ:Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.')]";
//
//    кнопка:Можно ли отменить заказ?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Можно ли отменить заказ?')]";
//
//    ответ:Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.')]";
//
//    кнопка:Я жизу за МКАДом, привезёте?
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Я жизу за МКАДом, привезёте?')]";
//
//    ответ:Да, обязательно. Всем самокатов! И Москве, и Московской области.
//    By.xpath (".//div[contains(@id, 'accordion__heading') and contains(text(), 'Да, обязательно. Всем самокатов! И Москве, и Московской области.')]";
//}
